FemDesign.Results.BarDisplacement
FemDesign "Bars, Displacements" result

FemDesign.Results.BarDisplacement.Id
Bar name identifier

FemDesign.Results.BarDisplacement.Pos
Position Result

FemDesign.Results.BarDisplacement.Ex
Displacement in Global or Local x

FemDesign.Results.BarDisplacement.Ey
Displacement in Global or Local y

FemDesign.Results.BarDisplacement.Ez
Displacement in Global or Local z

FemDesign.Results.BarDisplacement.Fix
Rotation around Global or Local x

FemDesign.Results.BarDisplacement.Fiy
Rotation around Global or Local y

FemDesign.Results.BarDisplacement.Fiz
Rotation around Global or Local z

FemDesign.Results.BarDisplacement.CaseIdentifier
Load case or combination name

FemDesign.Results.BarDisplacement.DeconstructBarDisplacements(System.Collections.Generic.List{FemDesign.Results.BarDisplacement},System.String)
The method has been created for returning the value for Grasshopper and Dynamo.
The method can still be use for C# users.